Tekla Open API Reference for Tekla Structures 2025
RebarGeometry.BendingRadiuses Property
The bending radiuses of the wire.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public ArrayList BendingRadiuses { get; }
Public ReadOnly Property BendingRadiuses As ArrayList
	Get
Property Value
Type: ArrayList
See Also
Reference
RebarGeometry Class
Tekla.Structures.Model Namespace